           05  LWW-LINKPAR.
               10  COMMONA        POINTER.
               10  DTOKEN         PIC X(16).
               10  BKMKNAME       PIC X(16).
               10  LREDURI        PIC X(08).
               10  STSCODE        PIC S9(4) USAGE COMP-5.
               10  STSTXT.
                   15  STSTXTL    PIC S9(4) USAGE COMP-5.
                   15  STSTXTT    PIC X(32).