          05 LPETM013.
             10 OPCODE             PIC N.
             10 RETURNCODE         PIC N(02).
             10 REASONCODE         PIC N(02).
             10 INFOMESSAGE        PIC N(72).
             10 STOREID            PIC S9(9) USAGE COMP-5.
             10 SUPPLIERID         PIC S9(9) USAGE COMP-5.
             10 FROMDATE           PIC N(26).
             10 TODATE             PIC N(26).
             10 CREATEDBY          PIC N(08).
             10 CREATEDDATE        PIC N(26).
             10 UPDATEDBY          PIC N(08).
             10 UPDATEDDATE        PIC N(26).
