//PETBIND  JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//BINDS   EXEC PGM=IKJEFT1B
//STEPLIB   DD DISP=SHR,DSN=DSND10.DBDG.SDSNEXIT
//          DD DISP=SHR,DSN=DSND10.SDSNLOAD
//SYSTSIN   DD *
  DSN SYSTEM(DBDG)
  BIND PLAN(PETDEV1) -
       PKLIST(PETD1.*) -
       OWNER(PETD1) -
       QUALIFIER(PETD1) -
       ACQUIRE(USE) -
       ENCODING(UNICODE)
  END
//SYSTSPRT  DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*