//PETBIND  JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//BINDS   EXEC PGM=IKJEFT1B
//STEPLIB   DD DISP=SHR,DSN={{DB2SSHLQ}}.SDSNEXIT
//          DD DISP=SHR,DSN={{DB2HLQ}}.SDSNLOAD
//SYSTSIN   DD *
  DSN SYSTEM({{DB2SSID}})
  BIND PLAN({{DB2PLAN}}) -
       PKLIST({{PKGCOLLID}}.*) -
       OWNER({{SQLID}}) -
       QUALIFIER({{SCHEMA}}) -
       ACQUIRE(USE) -
       ENCODING(UNICODE)
  END
//SYSTSPRT  DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*