//PETCSD   JOB 'PETSHOP CSD DEFS',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//*
//UPDCSD  EXEC PGM=DFHCSDUP,REGION=1M
//STEPLIB   DD DISP=SHR,DSN={{CICSHLQ}}.CICS.SDFHLOAD
//DFHCSD    DD DISP=SHR,DSN={{CICSCSD}}
//SYSIN     DD *
DEFINE TRANSACTION({{CICSTXN_API}}) GROUP({{CICSGRP}})
       DESCRIPTION('PETSHOP TRANSACTION')
       PROGRAM(DFHWBA)
DEFINE DB2ENTRY({{CICSTXN_API}}) GROUP({{CICSGRP}})
       DESCRIPTION('PETSHOP DB2ENTRY')
       TRANSID({{CICSTXN_API}}) PLAN({{DB2PLAN}})
DEFINE TRANSACTION({{CICSTXN_EMERGENCY}}) GROUP({{CICSGRP}})
       DESCRIPTION('PETSHOP TRANSACTION')
       PROGRAM(PETC900)
DEFINE DB2ENTRY({{CICSTXN_EMERGENCY}}) GROUP({{CICSGRP}})
       DESCRIPTION('PETSHOP DB2ENTRY')
       TRANSID({{CICSTXN_EMERGENCY}}) PLAN({{DB2PLAN}})
DEFINE LIBRARY({{CICSLIB}}) GROUP({{CICSGRP}})
       DESCRIPTION('PETSHOP LOAD LIBRARY')
       DSNAME01({{LOADLIB}})
ADD G({{CICSGRP}}) LI({{CICSLST}})
//CBDOUT    DD SYSOUT=*
//SYSUT1    DD UNIT=SYSDA,SPACE=(1024,(100,100))
//SYSPRINT  DD SYSOUT=*