//RACFJOB  JOB 'RACF',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//*
//STEP001 EXEC PROC=BATREXX
//COPY.SYSUT1 DD *,DLM=$$
/* REXX */
ADDRESS TSO "RDEF FACILITY DFHDB2.AUTHTYPE.{{CICSTXN_EMERGENCY}}" || ,
            " UACC(NONE)"
ADDRESS TSO "PE DFHDB2.AUTHTYPE.{{CICSTXN_EMERGENCY}}" || ,
            " CLASS(FACILITY) ACCESS(READ) ID(YINADMIN,YINUSER,STCMAS)"

ADDRESS TSO "RDEF GCICSTRN PETADM UACC(NONE)"
ADDRESS TSO "RALT GCICSTRN PETADM ADDMEM({{CICSTXN_EMERGENCY}})"
ADDRESS TSO "PE PETADM CLASS(GCICSTRN) ACCESS(READ) ID(YINADMIN)"

ADDRESS TSO "SETR RACLIST(FACILITY) REFRESH"
ADDRESS TSO "SETR RACLIST(TCICSTRN) REFRESH"
$$