//RUNDDL   JOB 'RUNDDL',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//*
//GRANT   EXEC PGM=IKJEFT1B
//STEPLIB   DD DISP=SHR,DSN=DSND10.DBDG.SDSNEXIT
//          DD DISP=SHR,DSN=DSND10.SDSNLOAD
//SYSTSIN   DD *
  DSN SYSTEM(DBDG)
  RUN PROGRAM(DSNTEP2) PLAN(DSNTEP13) -
      LIB('DSND10.DBDG.RUNLIB.LOAD')
  END
//SYSIN     DD DISP=SHR,DSN=
//SYSTSPRT  DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*