//RUNDDL   JOB 'RUNDDL',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//*
//GRANT   EXEC PGM=IKJEFT1B
//STEPLIB   DD DISP=SHR,DSN={{DB2SSHLQ}}.SDSNEXIT
//          DD DISP=SHR,DSN={{DB2HLQ}}.SDSNLOAD
//SYSTSIN   DD *
  DSN SYSTEM({{DB2SSID}})
  RUN PROGRAM(DSNTEP2) PLAN(DSNTEP13) -
      LIB('{{DB2SSHLQ}}.RUNLIB.LOAD')
  END
//SYSIN     DD DISP=SHR,DSN=
//SYSTSPRT  DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*